[ { 
    "text": "Financial stocks led a drop on Wall Street on Friday, as results from big banks failed to enthuse and geopolitical tensions in Syria and Russia further unnerved investors.",
    "category": "businessNews" },
  { 
    "text": "Lucas Strom, who runs a century-old family farm in rural Illinois, canceled an order to buy a new $71,000 grain storage bin last month - after the seller raised the price 5 percent in a day.",
    "category": "businessNews" },
  { 
    "text": "Banks have not reaped the full benefit of U.S. tax cuts, Wall Street executives said on Friday after a string of quarterly results, with expected business growth and higher consumer spending yet to materialize.",
    "category": "businessNews" },
  { 
    "text": "Two U.S. regulators have proposed Wells Fargo & Co  pay $1 billion in penalties to resolve probes into auto insurance and mortgage lending abuses at the third largest U.S. bank, overshadowing its first quarter results.",
    "category": "businessNews" },
  { 
    "text": "Tesla Inc  will be profitable in the third and fourth quarters of this year and will not have to raise any money from investors, billionaire Chief Executive Elon Musk said on Friday, driving shares in the electric carmaker higher.",
    "category": "businessNews" },
  { 
    "text": "Bratz doll maker MGA Entertainment said on Friday its billionaire founder and chief executive, Isaac Larian, had made an $890 million bid for Toys 'R' Us stores in the United States and Canada.",
    "category": "businessNews" },
  { 
    "text": "JPMorgan Chase & Co's  quarterly profit fell short of Wall Street expectations on Friday as lower revenue from investment banking ate into gains from stock trading and higher interest rates.",
    "category": "businessNews" },
  { 
    "text": "Wells Fargo & Co  believes the U.S. government, rather than banks, should set rules to promote gun safety, its finance chief said on Friday.",
    "category": "businessNews" },
  { 
    "text": "Citigroup Inc  reported a higher-than-expected quarterly profit on Friday, driven by strength in its consumer banking business and a surge in equities trading.",
    "category": "businessNews" },
  { 
    "text": "U.S. President Donald Trump on Thursday ordered the creation of a task force to study the U.S. Postal Service and its financial difficulties, after recently claiming without evidence that deliveries for Amazon.com Inc  were costing the service money.",
    "category": "businessNews" },
  { 
    "text": "Formula One world champion Lewis Hamilton edged out Kimi Raikkonen at the top of the timesheets as Ferrari ended the opening day of practice for Sunday’s Chinese Grand Prix hot on pacesetter Mercedes’ heels.",
    "category": "sportsNews" },
  { 
    "text": "The NBA postseason will have a distinct international flair with a record 62 foreign born players from 33 countries chasing a championship ring, the league said on Thursday.",
    "category": "sportsNews" },
  { 
    "text": "Formula One's commercial rights holders want a decision on post-2020 engine regulations to be decided by the end of May, Ferrari team-principal Maurizio Arrivabene told reporters on Friday.",
    "category": "sportsNews" },
  { 
    "text": "FIFA has proposed that a revamped and enlarged version of the Club World Cup, planned to start in 2021, would include all European champions, runners-up and Europa League winners from  the four seasons up to and including the year of the event.",
    "category": "sportsNews" },
  { 
    "text": "McLaren have been fined 5,000 euros ($6,161.00) after the Formula One team’s Belgian driver Stoffel Vandoorne was released from the pits with a loose wheel during Friday's Chinese Grand Prix practice.",
    "category": "sportsNews" },
  { 
    "text": "The International Weightlifting Federation hopes that innovative and creative rules targeting nations who have violated anti-doping regulations will secure the long term future of the sport in the Olympic program.",
    "category": "sportsNews" },
  { 
    "text": "England sprinter Zharnel Hughes said he had no choice but to accept the decision that robbed him of 200 meters gold at the Commonwealth Games, adding that making contact with rival Jereem Richards had been an accident.",
    "category": "sportsNews" },
  { 
    "text": "Russian billionaire Mikhail Prokhorov has sold a 49-percent stake in the Brooklyn Nets basketball team to Joe Tsai, the executive vice chairman and co-founder of the Alibaba Group, the NBA team said in a statement.",
    "category": "sportsNews" },
  { 
    "text": "Formula One is in talks with potential Chinese partners to set up a new local venture, four sources have told Reuters, which would help it push deeper into the huge but still nascent China market.",
    "category": "sportsNews" },
  { 
    "text": "Croatian Niko Kovac will succeed Jupp Heynckes as Bayern Munich coach next season, agreeing on a three-year contract, the German champions said on Friday.",
    "category": "sportsNews" },
  { 
    "text": "Tesla Inc  will be profitable in the third and fourth quarters of this year and will not have to raise any money from investors, billionaire Chief Executive Elon Musk said on Friday, driving shares in the electric carmaker higher.",
    "category": "technologyNews" },
  { 
    "text": "Satellite technology to provide Wi-Fi on board planes has matured to a point where more and more airlines are looking to use it, triggering a gold rush among suppliers.",
    "category": "technologyNews" },
  { 
    "text": "A Russian court on Friday ordered that access to the Telegram messenger service be blocked in Russia, heralding possible communication disruption for millions of users in the latest clash between global technology firms and Russian authorities.",
    "category": "technologyNews" },
  { 
    "text": "China's rising investment in research and expansion of its higher education system mean that it is fast closing the gap with the United States in intellectual property and the struggle to be the No.1 global technology power, according to patent experts.",
    "category": "technologyNews" },
  { 
    "text": "A bipartisan group of lawmakers in the U.S. House of Representatives on Friday sent a letter to FBI Director Christopher Wray questioning the law enforcement agency's decision to take Apple Inc to court to force the company to help unlock a mass shooter's iPhone.",
    "category": "technologyNews" },
  { 
    "text": "Singapore's competition watchdog on Friday outlined a set of interim measures for ride-hailing firms Grab and Uber Technologies to ensure an open market as it continued its  investigation into their merger in the city-state.",
    "category": "technologyNews" },
  { 
    "text": "In the not too distant future, surveillance cameras sitting atop over 100,000 lampposts in Singapore could help authorities pick out and recognize faces in crowds across the island-state.",
    "category": "technologyNews" },
  { 
    "text": "Italy's Open Fiber has enlisted banks to help fund the 6.5 billion euro ($8 billion) rollout of its fast broadband network, it said on Friday, confirming an earlier Reuters report.",
    "category": "technologyNews" },
  { 
    "text": "The Philippines' privacy watchdog said on Friday it has started investigating Facebook Inc  over a data breach involving British firm Cambridge Analytica that affected more than a million Filipino users of social media.",
    "category": "technologyNews" },
  { 
    "text": "Microsoft Corp is investigating the methods partner KPMG uses to crack down on the illegal use of its software in India, after a complaint from a senior member of the country's ruling political party, documents seen by Reuters showed.",
    "category": "technologyNews" },
  { 
    "text": "Generic drug maker Mylan NV is in advanced discussions to acquire Merck KGaA's consumer health business after other bidders failed to meet the German company's price expectations, people familiar with the matter said.",
    "category": "healthNews" },
  { 
    "text": "Kentucky state officials have agreed to hold off enforcing a new law that bans a common abortion procedure from the 11th week of pregnancy until a federal judge rules on a request by a civil liberties group challenging it, according to court papers.",
    "category": "healthNews" },
  { 
    "text": "Layers of squirming black soldier fly larvae fill large aluminum bins stacked 10-high in a warehouse outside of Vancouver. They are feeding on stale bread, rotting mangoes, overripe cantaloupe and squishy zucchini.",
    "category": "healthNews" },
  { 
    "text": "No. 2 U.S. nursing home chain HCR ManorCare Inc won court approval on Friday for a plan to exit a $7.1 billion Chapter 11 bankruptcy by transferring ownership to its landlord, Quality Care Properties Inc .",
    "category": "healthNews" },
  { 
    "text": "Although religiosity is generally tied to reduced suicide risk, the opposite may be true for some young lesbian, gay and questioning adults, researchers say.",
    "category": "healthNews" },
  { 
    "text": "A federal appeals court on Friday declared unconstitutional a 2017 Maryland law that lets the state attorney general sue generic drugmakers who sharply raise prices on medications.",
    "category": "healthNews" },
  { 
    "text": "Doctors who see fewer patients may get better online reviews than physicians who have higher-volume practices, a study of U.S. urologists suggests.",
    "category": "healthNews" },
  { 
    "text": "Fish oil supplements do not ease the symptoms of dry eye, a condition that affects about one in seven U.S. adults, according to a new test of the treatment in hundreds of volunteers.",
    "category": "healthNews" },
  { 
    "text": "CVS Health on Friday named Marc-David Munk as the new chief medical officer of MinuteClinic, the drugstore chain's retail medical clinic unit and as associate chief medical officer of the company.",
    "category": "healthNews" },
  { 
    "text": "GlaxoSmithKline is divesting its rare disease gene therapy drugs to private biotech company Orchard Therapeutics as Chief Executive Emma Walmsley makes good on her promise to prune the drugmaker's pharmaceuticals portfolio.",
    "category": "healthNews" },
  { 
    "text": "President Donald Trump attacked James Comey as a weak and untruthful slime ball on Friday after the fired former FBI director castigated him as an unethical liar and likened him to a mob moss in a searing new memoir.",
    "category": "politicsNews" },
  { 
    "text": "A lawyer for adult film star Stormy Daniels argued in a court hearing on Friday that materials seized by federal investigators from U.S. President Donald Trump's personal lawyer may concern his client, who claims the president slept with her.",
    "category": "politicsNews" },
  { 
    "text": "U.S. House Speaker Paul Ryan endorsed Republican House Majority Leader Kevin McCarthy to be his successor, NBC News reported on Friday.",
    "category": "politicsNews" },
  { 
    "text": "A bipartisan group of lawmakers in the U.S. House of Representatives on Friday sent a letter to FBI Director Christopher Wray questioning the law enforcement agency's decision to take Apple Inc to court to force the company to help unlock a mass shooter's iPhone.",
    "category": "politicsNews" },
  { 
    "text": "President Donald Trump's personal lawyer arranged for a $1.6 million payment to a Playboy Playmate to keep secret her sexual relationship with a top Republican fundraiser and ally of Trump, a person familiar with the matter said.",
    "category": "politicsNews" },
  { 
    "text": "The U.S. Department of Justice's inspector general disclosed a report on Friday that concluded that former FBI Deputy Director Andrew McCabe had repeatedly misled investigators about his role in giving information to a reporter.",
    "category": "politicsNews" },
  { 
    "text": "U.S. President Donald Trump said the United States would only join the Trans Pacific Partnership, a multinational trade deal his administration walked away from last year, if it offered substantially better terms than those provided under previous negotiations.",
    "category": "politicsNews" },
  { 
    "text": "A six-month budget truce stitched together by Congress in March could unravel if Republican leaders vying to replace U.S. House of Representatives Speaker Paul Ryan indulge party conservatives who want to renege on critical parts of the pact.",
    "category": "politicsNews" },
  { 
    "text": "The top U.S. watchdog for protecting consumers against financial abuse on Thursday blamed employees for leaking information about cases that he had dropped or was aiming to settle, according to an internal memo reviewed by Reuters.",
    "category": "politicsNews" },
  { 
    "text": "An interview of U.S. President Donald Trump by special counsel Robert Mueller was less likely after this week's FBI raids on Trump's personal lawyer, two people familiar with the matter said on Thursday.",
    "category": "politicsNews" }
  ]